project/okgj/train-temp/view.org
#+startup:indent
#+title:欧科ERP界面开发培训
#+author:聂春应
#+options:^:nil

* 第一部分 菜单
#+begin_src xml
  <menuitem id="menuitem_id"
            name="我是菜单"
            sequence="15"/>
#+end_src
关联动作后，name默认为动作(Action)的name

* 添加父级菜单
#+begin_src xml
  <menuitem id="menuitem_id"
            parent="stock.menu_stock_warehouse_mgmt" 
            name="我是菜单"
            sequence="15"/>
#+end_src
关键字:parent

* 添加权限
#+begin_src xml
  <menuitem id="menuitem_id"
            parent="stock.menu_stock_warehouse_mgmt"
            name="我是菜单"
            groups="account.group_account_invoice"
            sequence="15"/>
#+end_src
关键字:groups

* 添加菜单关联动作
#+begin_src xml
  <menuitem id="menuitem_id"
            parent="stock.menu_stock_warehouse_mgmt"
            name="我是菜单"
            action="action_id"
            groups="account.group_account_invoice"
            sequence="15"/>
#+end_src
关键字:action

* 第二部分 动作
#+begin_src xml
  <record id="action_okgj_stock_picking_out_more" model="ir.actions.act_window">
      <field name="name">复核出库</field>
      <field name="res_model">stock.picking.out</field>
      <field name="type">ir.actions.act_window</field>
      <field name="view_type">form</field>
      <field name="view_mode">tree,form</field>
  </record>
#+end_src
  1. name: 动作名称
  2. res_model: 关联模型
  3. view_type:
	 1) form 可编辑
	 2) tree 只可看
  4. view_mode:
	 1) tree,form 先打开tree，后打开form
	 2) form,tree 先打开form，后打开tree
	 3) tree 只有tree
	 4) form 只有form
	 5) 另外还有kanban, calendar, graph

* 指定该菜单的限制条件
#+begin_src xml
  <record id="action_okgj_stock_picking_out_more" model="ir.actions.act_window">
      <field name="name">复核出库</field>
      <field name="res_model">stock.picking.out</field>
      <field name="type">ir.actions.act_window</field>
      <field name="view_type">form</field>
      <field name="view_mode">tree,form</field>
      <field name="domain">[('type','=','out')]</field>
  </record>
#+end_src
  1. domain，可以组合
	 1) <field name="domain">[('location_dest_id.usage', 'in', ['production']), '|', ('picking_id','=', False), ('picking_id.type', '=', 'internal')]</field>
	 2) <field name="domain">[('journal_id.type', 'in', ['bank', 'cash']), ('type','=','receipt'), ('partner_id','=',partner_id)]</field>

