project/okgj/train-temp/view.html

<!DOCTYPE html>
<!--
  Copyright 2010 Google Inc.

  Licensed under the Apache License, Version 2.0 (the "License");
  you may not use this file except in compliance with the License.
  You may obtain a copy of the License at

     http://www.apache.org/licenses/LICENSE-2.0

  Unless required by applicable law or agreed to in writing, software
  distributed under the License is distributed on an "AS IS" BASIS,
  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  See the License for the specific language governing permissions and
  limitations under the License.

  Original slides: Marcin Wichary (mwichary@google.com)
  Modifications: Ernest Delgado (ernestd@google.com)
		 Alex Russell (slightlyoff@chromium.org)
		 Brad Neuberg
-->
<html>
<head>
<title>欧科ERP界面开发培训</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta http-equiv="X-UA-Compatible" content="chrome=1">
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-03-20 09:06:20 HKT"/>
<meta name="author" content="聂春应"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>
<div class="presentation">
<div id="content">


<div class="slide">
  <section class="center intro">
    <style>
      span.strike { text-decoration:line-through;}
    </style>
    <h2>
      欧科ERP界面开发培训
    </h2>
    <p style="margin-top:100px">
      聂春应
    </p>
    <p style="font-size: 25px; line-height: 180%;">Press <span class="key">&rarr;</span> key to advance.<br />
    Zoom in/out: <span class="key">Ctrl or Command</span> + <span class="key">+/-</span></p>
  </section>
</div>

<div class="slide">
<header><h1><span class="section-number-2">1</span> 第一部分 菜单 </h1></header>

<section>



<pre class="src src-xml">&lt;<span style="color: #0000ff;">menuitem</span> <span style="color: #a0522d;">id</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">menuitem_id</span><span style="color: #8b2252;">"</span>
          <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">&#25105;&#26159;&#33756;&#21333;</span><span style="color: #8b2252;">"</span>
          <span style="color: #a0522d;">sequence</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">15</span><span style="color: #8b2252;">"</span>/&gt;
</pre>

<p>
关联动作后，name默认为动作(Action)的name
</p>
</section>

</div>

<div class="slide">
<header><h1><span class="section-number-2">2</span> 添加父级菜单 </h1></header>

<section>



<pre class="src src-xml">&lt;<span style="color: #0000ff;">menuitem</span> <span style="color: #a0522d;">id</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">menuitem_id</span><span style="color: #8b2252;">"</span>
          <span style="color: #a0522d;">parent</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">stock.menu_stock_warehouse_mgmt</span><span style="color: #8b2252;">"</span> 
          <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">&#25105;&#26159;&#33756;&#21333;</span><span style="color: #8b2252;">"</span>
          <span style="color: #a0522d;">sequence</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">15</span><span style="color: #8b2252;">"</span>/&gt;
</pre>

<p>
关键字:parent
</p>
</section>

</div>

<div class="slide">
<header><h1><span class="section-number-2">3</span> 添加权限 </h1></header>

<section>



<pre class="src src-xml">&lt;<span style="color: #0000ff;">menuitem</span> <span style="color: #a0522d;">id</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">menuitem_id</span><span style="color: #8b2252;">"</span>
          <span style="color: #a0522d;">parent</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">stock.menu_stock_warehouse_mgmt</span><span style="color: #8b2252;">"</span>
          <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">&#25105;&#26159;&#33756;&#21333;</span><span style="color: #8b2252;">"</span>
          <span style="color: #a0522d;">groups</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">account.group_account_invoice</span><span style="color: #8b2252;">"</span>
          <span style="color: #a0522d;">sequence</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">15</span><span style="color: #8b2252;">"</span>/&gt;
</pre>

<p>
关键字:groups
</p>
</section>

</div>

<div class="slide">
<header><h1><span class="section-number-2">4</span> 添加菜单关联动作 </h1></header>

<section>



<pre class="src src-xml">&lt;<span style="color: #0000ff;">menuitem</span> <span style="color: #a0522d;">id</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">menuitem_id</span><span style="color: #8b2252;">"</span>
          <span style="color: #a0522d;">parent</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">stock.menu_stock_warehouse_mgmt</span><span style="color: #8b2252;">"</span>
          <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">&#25105;&#26159;&#33756;&#21333;</span><span style="color: #8b2252;">"</span>
          <span style="color: #a0522d;">action</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">action_id</span><span style="color: #8b2252;">"</span>
          <span style="color: #a0522d;">groups</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">account.group_account_invoice</span><span style="color: #8b2252;">"</span>
          <span style="color: #a0522d;">sequence</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">15</span><span style="color: #8b2252;">"</span>/&gt;
</pre>

<p>
关键字:action
</p>
</section>

</div>

<div class="slide">
<header><h1><span class="section-number-2">5</span> 第二部分 动作 </h1></header>

<section>



<pre class="src src-xml">&lt;<span style="color: #0000ff;">record</span> <span style="color: #a0522d;">id</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">action_okgj_stock_picking_out_more</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">model</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">ir.actions.act_window</span><span style="color: #8b2252;">"</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">name</span><span style="color: #8b2252;">"</span>&gt;&#22797;&#26680;&#20986;&#24211;&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">res_model</span><span style="color: #8b2252;">"</span>&gt;stock.picking.out&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">type</span><span style="color: #8b2252;">"</span>&gt;ir.actions.act_window&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">view_type</span><span style="color: #8b2252;">"</span>&gt;form&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">view_mode</span><span style="color: #8b2252;">"</span>&gt;tree,form&lt;/<span style="color: #0000ff;">field</span>&gt;
&lt;/<span style="color: #0000ff;">record</span>&gt;
</pre>

<ol class="summary">
<li>name: 动作名称
</li>
<li>res_model: 关联模型
</li>
<li>view_type:
<ol class="summary">
<li>form 可编辑
</li>
<li>tree 只可看
</li>
</ol>

</li>
<li>view_mode:
<ol class="summary">
<li>tree,form 先打开tree，后打开form
</li>
<li>form,tree 先打开form，后打开tree
</li>
<li>tree 只有tree
</li>
<li>form 只有form
</li>
<li>另外还有kanban, calendar, graph
</li>
</ol>

</li>
</ol>


</section>

</div>

<div class="slide">
<header><h1><span class="section-number-2">6</span> 指定该菜单的限制条件 </h1></header>

<section>



<pre class="src src-xml">&lt;<span style="color: #0000ff;">record</span> <span style="color: #a0522d;">id</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">action_okgj_stock_picking_out_more</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">model</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">ir.actions.act_window</span><span style="color: #8b2252;">"</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">name</span><span style="color: #8b2252;">"</span>&gt;&#22797;&#26680;&#20986;&#24211;&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">res_model</span><span style="color: #8b2252;">"</span>&gt;stock.picking.out&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">type</span><span style="color: #8b2252;">"</span>&gt;ir.actions.act_window&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">view_type</span><span style="color: #8b2252;">"</span>&gt;form&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">view_mode</span><span style="color: #8b2252;">"</span>&gt;tree,form&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">domain</span><span style="color: #8b2252;">"</span>&gt;[('type','=','out')]&lt;/<span style="color: #0000ff;">field</span>&gt;
&lt;/<span style="color: #0000ff;">record</span>&gt;
</pre>

<ol class="summary">
<li>domain，可以组合
<ol class="summary">
<li>&lt;field name="domain"&gt;[('location_dest_id.usage', 'in', ['production']), '|', ('picking_id','=', False), ('picking_id.type', '=', 'internal')]&lt;/field&gt;
</li>
<li>&lt;field name="domain"&gt;[('journal_id.type', 'in', ['bank', 'cash']), ('type','=','receipt'), ('partner_id','=',partner_id)]&lt;/field&gt;
</li>
</ol>

</li>
</ol>


</section>

</div>

<div class="slide">
<header><h1><span class="section-number-2">7</span> 添加环境 </h1></header>
