project/okgj/train-temp/view.org
* 添加环境
#+begin_src xml
  <record id="action_okgj_stock_picking_out_more" model="ir.actions.act_window">
      <field name="name">复核出库</field>
      <field name="res_model">stock.picking.out</field>
      <field name="type">ir.actions.act_window</field>
      <field name="view_type">form</field>
      <field name="view_mode">tree,form</field>
      <field name="domain">[('type','=','out')]</field>
      <field name="context">{}</field>
  </record>
#+end_src
  1. 用于指定默认值
	 1) <field name="context">{'default_type':'receipt', 'type':'receipt', 'partner_id': partner_id, 'default_reference':reference}</field>

* 帮助
#+begin_src xml
        <record id="action_okgj_stock_picking_out_more" model="ir.actions.act_window">
            <field name="name">复核出库</field>
            <field name="res_model">stock.picking.out</field>
            <field name="type">ir.actions.act_window</field>
            <field name="view_type">form</field>
            <field name="view_mode">tree,form</field>
            <field name="domain">[('type','=','out')]</field>
            <field name="context">{}</field>
            <field name="help" type="html">
              <p class="oe_view_nocontent_create">
                点击创建复核出库单
              </p>
              <p>
		  复核出库帮助，将会依据仓库加入更多限制最终只显示复核出库的条目！
              </p>
            </field>
        </record>
#+end_src

* 关联view
#+begin_src xml
  <record id="action_okgj_stock_picking_out_more" model="ir.actions.act_window">
      <field name="name">复核出库</field>
      <field name="res_model">stock.picking.out</field>
      <field name="type">ir.actions.act_window</field>
      <field name="view_type">form</field>
      <field name="view_mode">tree,form</field>
      <field name="search_view_id" ref="view_okgj_stock_picking_out_more_search"/>
      <field name="domain">[('type','=','out')]</field>
      <field name="context">{}</field>
      <field name="help" type="html">
          <p>
              复核出库帮助，将会依据仓库加入更多限制最终只显示复核出库的条目！
          </p>
      </field>
  </record>
#+end_src
  1. search view关联：<field name="search_view_id" ref="view_okgj_stock_picking_out_more_search"/>
  2. 默认打开view关联：<field name="view_id" ref="view_warehouse_orderpoint_tree"/>

* 更多view关联方式:反向关联
#+begin_src xml
  <record id="act_view_okgj_stock_picking_out_more_tree" model="ir.actions.act_window.view">
      <field eval="1" name="sequence"/>
      <field name="view_mode">tree</field>
      <field name="view_id" ref="view_okgj_stock_picking_out_more_tree"/>
      <field name="act_window_id" ref="action_okgj_stock_picking_out_more"/>
  </record>
#+end_src

