project/okgj/train-temp/view.html

<section>



<pre class="src src-xml">&lt;<span style="color: #0000ff;">record</span> <span style="color: #a0522d;">id</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">action_okgj_stock_picking_out_more</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">model</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">ir.actions.act_window</span><span style="color: #8b2252;">"</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">name</span><span style="color: #8b2252;">"</span>&gt;&#22797;&#26680;&#20986;&#24211;&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">res_model</span><span style="color: #8b2252;">"</span>&gt;stock.picking.out&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">type</span><span style="color: #8b2252;">"</span>&gt;ir.actions.act_window&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">view_type</span><span style="color: #8b2252;">"</span>&gt;form&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">view_mode</span><span style="color: #8b2252;">"</span>&gt;tree,form&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">domain</span><span style="color: #8b2252;">"</span>&gt;[('type','=','out')]&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">context</span><span style="color: #8b2252;">"</span>&gt;{}&lt;/<span style="color: #0000ff;">field</span>&gt;
&lt;/<span style="color: #0000ff;">record</span>&gt;
</pre>

<ol class="summary">
<li>用于指定默认值
<ol class="summary">
<li>&lt;field name="context"&gt;{'default_type':'receipt', 'type':'receipt', 'partner_id': partner_id, 'default_reference':reference}&lt;/field&gt;
</li>
</ol>

</li>
</ol>


</section>

</div>

<div class="slide">
<header><h1><span class="section-number-2">8</span> 帮助 </h1></header>

<section>



<pre class="src src-xml">&lt;<span style="color: #0000ff;">record</span> <span style="color: #a0522d;">id</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">action_okgj_stock_picking_out_more</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">model</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">ir.actions.act_window</span><span style="color: #8b2252;">"</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">name</span><span style="color: #8b2252;">"</span>&gt;&#22797;&#26680;&#20986;&#24211;&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">res_model</span><span style="color: #8b2252;">"</span>&gt;stock.picking.out&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">type</span><span style="color: #8b2252;">"</span>&gt;ir.actions.act_window&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">view_type</span><span style="color: #8b2252;">"</span>&gt;form&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">view_mode</span><span style="color: #8b2252;">"</span>&gt;tree,form&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">domain</span><span style="color: #8b2252;">"</span>&gt;[('type','=','out')]&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">context</span><span style="color: #8b2252;">"</span>&gt;{}&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">help</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">type</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">html</span><span style="color: #8b2252;">"</span>&gt;
      &lt;<span style="color: #0000ff;">p</span> <span style="color: #a0522d;">class</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">oe_view_nocontent_create</span><span style="color: #8b2252;">"</span>&gt;
        &#28857;&#20987;&#21019;&#24314;&#22797;&#26680;&#20986;&#24211;&#21333;
      &lt;/<span style="color: #0000ff;">p</span>&gt;
      &lt;<span style="color: #0000ff;">p</span>&gt;
          &#22797;&#26680;&#20986;&#24211;&#24110;&#21161;&#65292;&#23558;&#20250;&#20381;&#25454;&#24211;&#20301;&#21152;&#20837;&#26356;&#22810;&#38480;&#21046;&#26368;&#32456;&#21482;&#26174;&#31034;&#22797;&#26680;&#20986;&#24211;&#30340;&#26465;&#30446;&#65281;
      &lt;/<span style="color: #0000ff;">p</span>&gt;
    &lt;/<span style="color: #0000ff;">field</span>&gt;
&lt;/<span style="color: #0000ff;">record</span>&gt;
</pre>


</section>

</div>

<div class="slide">
<header><h1><span class="section-number-2">9</span> 关联view </h1></header>

<section>



<pre class="src src-xml">&lt;<span style="color: #0000ff;">record</span> <span style="color: #a0522d;">id</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">action_okgj_stock_picking_out_more</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">model</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">ir.actions.act_window</span><span style="color: #8b2252;">"</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">name</span><span style="color: #8b2252;">"</span>&gt;&#22797;&#26680;&#20986;&#24211;&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">res_model</span><span style="color: #8b2252;">"</span>&gt;stock.picking.out&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">type</span><span style="color: #8b2252;">"</span>&gt;ir.actions.act_window&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">view_type</span><span style="color: #8b2252;">"</span>&gt;form&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">view_mode</span><span style="color: #8b2252;">"</span>&gt;tree,form&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">search_view_id</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">ref</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">view_okgj_stock_picking_out_more_search</span><span style="color: #8b2252;">"</span>/&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">domain</span><span style="color: #8b2252;">"</span>&gt;[('type','=','out')]&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">context</span><span style="color: #8b2252;">"</span>&gt;{}&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">help</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">type</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">html</span><span style="color: #8b2252;">"</span>&gt;
        &lt;<span style="color: #0000ff;">p</span>&gt;
            &#22797;&#26680;&#20986;&#24211;&#24110;&#21161;&#65292;&#23558;&#20250;&#20381;&#25454;&#24211;&#20301;&#21152;&#20837;&#26356;&#22810;&#38480;&#21046;&#26368;&#32456;&#21482;&#26174;&#31034;&#22797;&#26680;&#20986;&#24211;&#30340;&#26465;&#30446;&#65281;
        &lt;/<span style="color: #0000ff;">p</span>&gt;
    &lt;/<span style="color: #0000ff;">field</span>&gt;
&lt;/<span style="color: #0000ff;">record</span>&gt;
</pre>

<ol class="summary">
<li>search view关联：&lt;field name="search_view_id" ref="view_okgj_stock_picking_out_more_search"/&gt;
</li>
<li>默认打开view关联：&lt;field name="view_id" ref="view_warehouse_orderpoint_tree"/&gt;
</li>
</ol>


</section>

</div>

<div class="slide">
<header><h1><span class="section-number-2">10</span> 更多view关联方式:反向关联 </h1></header>

<section>



<pre class="src src-xml">&lt;<span style="color: #0000ff;">record</span> <span style="color: #a0522d;">id</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">act_view_okgj_stock_picking_out_more_tree</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">model</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">ir.actions.act_window.view</span><span style="color: #8b2252;">"</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">eval</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">1</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">sequence</span><span style="color: #8b2252;">"</span>/&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">view_mode</span><span style="color: #8b2252;">"</span>&gt;tree&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">view_id</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">ref</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">view_okgj_stock_picking_out_more_tree</span><span style="color: #8b2252;">"</span>/&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">act_window_id</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">ref</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">action_okgj_stock_picking_out_more</span><span style="color: #8b2252;">"</span>/&gt;
&lt;/<span style="color: #0000ff;">record</span>&gt;
</pre>


</section>

</div>

<div class="slide">
<header><h1><span class="section-number-2">11</span> 第三部分 视图 </h1></header>
