project/okgj/train-temp/view.org
* 第三部分 视图
#+begin_src xml
  <record id="view_okgj_stock_picking_extra_form" model="ir.ui.view">
      <field name="name">view.okgj.stock.picking.extra.form</field>
      <field name="model">okgj.stock.picking.extra</field>
      <field eval="16" name="priority"/>
      <field name="arch" type="xml">
          <form string="外挂">
              <field name="product_id"/>
          </form>
      </field>
  </record>
#+end_src
  1. 视图类型:form, tree, kanban, calendar, gantt, graph

* form视图常见属性
#+begin_src xml
  <record id="view_okgj_stock_picking_extra_form" model="ir.ui.view">
      <field name="name">view.okgj.stock.picking.extra.form</field>
      <field name="model">okgj.stock.picking.extra</field>
      <field eval="16" name="priority"/>
      <field name="arch" type="xml">
          <form string="外挂">
              <field name="product_id"/>
              <newline/>
              <field name="product_qty"/>
          </form>
      </field>
  </record>
#+end_src
  1. newline 换行

* form视图常见属性
#+begin_src xml
  <record id="view_okgj_stock_picking_extra_form" model="ir.ui.view">
      <field name="name">view.okgj.stock.picking.extra.form</field>
      <field name="model">okgj.stock.picking.extra</field>
      <field eval="16" name="priority"/>
      <field name="arch" type="xml">
          <form string="外挂">
              <field name="product_id" domain="[('type','=','consu')]"/>
          </form>
      </field>
  </record>
#+end_src
  1. domain，限制选择范围（关系字段）

* form视图常见属性
#+begin_src xml
  <record id="view_okgj_stock_picking_extra_form" model="ir.ui.view">
      <field name="name">view.okgj.stock.picking.extra.form</field>
      <field name="model">okgj.stock.picking.extra</field>
      <field eval="16" name="priority"/>
      <field name="arch" type="xml">
          <form string="外挂">
              <field name="product_id" domain="[('type','=','consu')]" groups="product.group_purchase_pricelist"/>
          </form>
      </field>
  </record>
#+end_src
  1. groups，操作权限

