project/okgj/train-temp/view.org
* form视图常见属性
#+begin_src xml
  <record id="view_okgj_stock_picking_extra_form" model="ir.ui.view">
      <field name="name">view.okgj.stock.picking.extra.form</field>
      <field name="model">okgj.stock.picking.extra</field>
      <field eval="16" name="priority"/>
      <field name="arch" type="xml">
          <form string="外挂">
              <field name="product_id" domain="[('type','=','consu')]"  on_change="onchange_pricelist(product_id, context)"/>
          </form>
      </field>
  </record>
#+end_src
  1. on_change，该字段变化将调用关联方法，引起其它字段变化

* form视图常见属性
#+begin_src xml
  <record id="view_okgj_stock_picking_extra_form" model="ir.ui.view">
      <field name="name">view.okgj.stock.picking.extra.form</field>
      <field name="model">okgj.stock.picking.extra</field>
      <field eval="16" name="priority"/>
      <field name="arch" type="xml">
          <form string="外挂">
              <field name="warehouse_id" on_change="onchange_warehouse_id(warehouse_id)" widget="selection" groups="stock.group_locations"/>
          </form>
      </field>
  </record>
#+end_src
  1. widget，指定该字段在该视图上使用哪种widget
  2. 常见one2many_list， many2one_list，many2many，many2many_tag, url，email，image，float_time，reference, status_bar……

* form视图常见属性
#+begin_src xml
  <record id="view_okgj_stock_picking_extra_form" model="ir.ui.view">
      <field name="name">view.okgj.stock.picking.extra.form</field>
      <field name="model">okgj.stock.picking.extra</field>
      <field eval="16" name="priority"/>
      <field name="arch" type="xml">
          <form string="外挂">
              <field name="product_id" domain="[('type','=','consu')]" invisible='1'/>
          </form>
      </field>
  </record>
#+end_src
  1. invisible，该字段将不可见

* form视图常见属性
#+begin_src xml
  <record id="view_okgj_stock_picking_extra_form" model="ir.ui.view">
      <field name="name">view.okgj.stock.picking.extra.form</field>
      <field name="model">okgj.stock.picking.extra</field>
      <field eval="16" name="priority"/>
      <field name="arch" type="xml">
          <form string="外挂">
              <field name="product_id" domain="[('type','=','consu')]" invisible='1'/>
          </form>
      </field>
  </record>
#+end_src
  1. invisible，该字段将不可见


