project/okgj/train-temp/view.org
* form视图继承
#+begin_src xml
  <record id="view_product_supplier_inherit" model="ir.ui.view">
      <field name="name">product.normal.supplier.form.inherit</field>
      <field name="model">product.product</field>
      <field name="inherit_id" ref="product.product_normal_form_view"/>
      <field name="arch" type="xml">
          <div name="options" position="inside">
              <field name="purchase_ok"/>
          </div>
          <group name="procurement" position="after">
              <field name="seller_ids" context="{'uom_id': uom_id}"/>
          </group>
          <xpath expr="//field[@name='supplier_taxes_id']" position="replace" >
              <field name="supplier_taxes_id" colspan="2" widget="many2many_tags" attrs="{'readonly':[('purchase_ok','=',0)]}"/>
          </xpath>
  
      </field>
  </record>
#+end_src
  1. inherit，所继承的视图
  2. position,位置
	 1) before 分类前
	 2) after 分类后
	 3) replace 替换分类
	 4) inside 分类里
  3. xpath定位更精准

* form视图常见属性
#+begin_src xml
  <record id="view_okgj_stock_picking_extra_form" model="ir.ui.view">
      <field name="name">view.okgj.stock.picking.extra.form</field>
      <field name="model">okgj.stock.picking.extra</field>
      <field eval="16" name="priority"/>
      <field name="arch" type="xml">
          <form string="外挂">
              <separator string="商品"/>
              <field name="product_id" domain="[('type','=','consu')]"/>
          </form>
      </field>
  </record>
#+end_src
  1. separator，分隔线

* form视图常见属性
#+begin_src xml
  <record id="view_okgj_stock_picking_extra_form" model="ir.ui.view">
      <field name="name">view.okgj.stock.picking.extra.form</field>
      <field name="model">okgj.stock.picking.extra</field>
      <field eval="16" name="priority"/>
      <field name="arch" type="xml">
          <form string="外挂">
              <label string="商品"/>
              <field name="product_id" domain="[('type','=','consu')]"/>
          </form>
      </field>
  </record>
#+end_src
  1. label，分类

