project/okgj/train-temp/view.html

<section>



<pre class="src src-xml">&lt;<span style="color: #0000ff;">record</span> <span style="color: #a0522d;">id</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">view_product_supplier_inherit</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">model</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">ir.ui.view</span><span style="color: #8b2252;">"</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">name</span><span style="color: #8b2252;">"</span>&gt;product.normal.supplier.form.inherit&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">model</span><span style="color: #8b2252;">"</span>&gt;product.product&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">inherit_id</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">ref</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">product.product_normal_form_view</span><span style="color: #8b2252;">"</span>/&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">arch</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">type</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">xml</span><span style="color: #8b2252;">"</span>&gt;
        &lt;<span style="color: #0000ff;">div</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">options</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">position</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">inside</span><span style="color: #8b2252;">"</span>&gt;
            &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">purchase_ok</span><span style="color: #8b2252;">"</span>/&gt;
        &lt;/<span style="color: #0000ff;">div</span>&gt;
        &lt;<span style="color: #0000ff;">group</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">procurement</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">position</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">after</span><span style="color: #8b2252;">"</span>&gt;
            &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">seller_ids</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">context</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">{'uom_id': uom_id}</span><span style="color: #8b2252;">"</span>/&gt;
        &lt;/<span style="color: #0000ff;">group</span>&gt;
        &lt;<span style="color: #0000ff;">xpath</span> <span style="color: #a0522d;">expr</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">//field[@name='supplier_taxes_id']</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">position</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">replace</span><span style="color: #8b2252;">"</span> &gt;
            &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">supplier_taxes_id</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">colspan</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">2</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">widget</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">many2many_tags</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">attrs</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">{'readonly':[('purchase_ok','=',0)]}</span><span style="color: #8b2252;">"</span>/&gt;
        &lt;/<span style="color: #0000ff;">xpath</span>&gt;

    &lt;/<span style="color: #0000ff;">field</span>&gt;
&lt;/<span style="color: #0000ff;">record</span>&gt;
</pre>

<ol class="summary">
<li>inherit，所继承的视图
</li>
<li>position,位置
<ol class="summary">
<li>before 分类前
</li>
<li>after 分类后
</li>
<li>replace 替换分类
</li>
<li>inside 分类里
</li>
</ol>

</li>
<li>xpath定位更精准
</li>
</ol>


</section>

</div>

<div class="slide">
<header><h1><span class="section-number-2">22</span> form视图常见属性 </h1></header>

<section>



<pre class="src src-xml">&lt;<span style="color: #0000ff;">record</span> <span style="color: #a0522d;">id</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">view_okgj_stock_picking_extra_form</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">model</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">ir.ui.view</span><span style="color: #8b2252;">"</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">name</span><span style="color: #8b2252;">"</span>&gt;view.okgj.stock.picking.extra.form&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">model</span><span style="color: #8b2252;">"</span>&gt;okgj.stock.picking.extra&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">eval</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">16</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">priority</span><span style="color: #8b2252;">"</span>/&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">arch</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">type</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">xml</span><span style="color: #8b2252;">"</span>&gt;
        &lt;<span style="color: #0000ff;">form</span> <span style="color: #a0522d;">string</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">&#22806;&#25346;</span><span style="color: #8b2252;">"</span>&gt;
            &lt;<span style="color: #0000ff;">separator</span> <span style="color: #a0522d;">string</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">&#21830;&#21697;</span><span style="color: #8b2252;">"</span>/&gt;
            &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">product_id</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">domain</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">[('type','=','consu')]</span><span style="color: #8b2252;">"</span>/&gt;
        &lt;/<span style="color: #0000ff;">form</span>&gt;
    &lt;/<span style="color: #0000ff;">field</span>&gt;
&lt;/<span style="color: #0000ff;">record</span>&gt;
</pre>

<ol class="summary">
<li>separator，分隔线
</li>
</ol>


</section>

</div>

<div class="slide">
<header><h1><span class="section-number-2">23</span> form视图常见属性 </h1></header>
