project/okgj/train-temp/view.org
* form视图常见属性
#+begin_src xml
  <record id="view_okgj_stock_picking_extra_form" model="ir.ui.view">
      <field name="name">view.okgj.stock.picking.extra.form</field>
      <field name="model">okgj.stock.picking.extra</field>
      <field eval="16" name="priority"/>
      <field name="arch" type="xml">
          <form string="外挂">
              <button name="wkf_send_rfq" states="draft" string="Send by Email" type="object" context="{'send_rfq':True}" class="oe_highlight"/>
              <field name="product_id" domain="[('type','=','consu')]"/>
          </form>
      </field>
  </record>
#+end_src
  1. button，按钮
	 1) states 在state字段属于该状态时显示，其它状态不显示
	 2) name  所调用的函数或者工作流
	 3) string 按钮上所显示的内容
	 4) type为object时该按钮为方法，为workflow时该按钮为工作流

* form视图常见属性
#+begin_src xml
  <record id="view_okgj_stock_picking_extra_form" model="ir.ui.view">
      <field name="name">view.okgj.stock.picking.extra.form</field>
      <field name="model">okgj.stock.picking.extra</field>
      <field eval="16" name="priority"/>
      <field name="arch" type="xml">
          <form string="外挂">
              <group>
                  <field name="product_id" domain="[('type','=','consu')]"/>
                  <field name="product_qty"/>
              </group>
          </form>
      </field>
  </record>
#+end_src
  1. group，成组

