project/okgj/train-temp/view.html

<section>



<pre class="src src-xml">&lt;<span style="color: #0000ff;">record</span> <span style="color: #a0522d;">id</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">view_okgj_stock_picking_extra_form</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">model</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">ir.ui.view</span><span style="color: #8b2252;">"</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">name</span><span style="color: #8b2252;">"</span>&gt;view.okgj.stock.picking.extra.form&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">model</span><span style="color: #8b2252;">"</span>&gt;okgj.stock.picking.extra&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">eval</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">16</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">priority</span><span style="color: #8b2252;">"</span>/&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">arch</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">type</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">xml</span><span style="color: #8b2252;">"</span>&gt;
        &lt;<span style="color: #0000ff;">form</span> <span style="color: #a0522d;">string</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">&#22806;&#25346;</span><span style="color: #8b2252;">"</span>&gt;
            &lt;<span style="color: #0000ff;">label</span> <span style="color: #a0522d;">string</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">&#21830;&#21697;</span><span style="color: #8b2252;">"</span>/&gt;
            &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">product_id</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">domain</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">[('type','=','consu')]</span><span style="color: #8b2252;">"</span>/&gt;
        &lt;/<span style="color: #0000ff;">form</span>&gt;
    &lt;/<span style="color: #0000ff;">field</span>&gt;
&lt;/<span style="color: #0000ff;">record</span>&gt;
</pre>

<ol class="summary">
<li>label，分类
</li>
</ol>


</section>

</div>

<div class="slide">
<header><h1><span class="section-number-2">24</span> form视图常见属性 </h1></header>

<section>



<pre class="src src-xml">&lt;<span style="color: #0000ff;">record</span> <span style="color: #a0522d;">id</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">view_okgj_stock_picking_extra_form</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">model</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">ir.ui.view</span><span style="color: #8b2252;">"</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">name</span><span style="color: #8b2252;">"</span>&gt;view.okgj.stock.picking.extra.form&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">model</span><span style="color: #8b2252;">"</span>&gt;okgj.stock.picking.extra&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">eval</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">16</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">priority</span><span style="color: #8b2252;">"</span>/&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">arch</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">type</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">xml</span><span style="color: #8b2252;">"</span>&gt;
        &lt;<span style="color: #0000ff;">form</span> <span style="color: #a0522d;">string</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">&#22806;&#25346;</span><span style="color: #8b2252;">"</span>&gt;
            &lt;<span style="color: #0000ff;">button</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">wkf_send_rfq</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">states</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">draft</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">string</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">Send by Email</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">type</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">object</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">context</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">{'send_rfq':True}</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">class</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">oe_highlight</span><span style="color: #8b2252;">"</span>/&gt;
            &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">product_id</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">domain</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">[('type','=','consu')]</span><span style="color: #8b2252;">"</span>/&gt;
        &lt;/<span style="color: #0000ff;">form</span>&gt;
    &lt;/<span style="color: #0000ff;">field</span>&gt;
&lt;/<span style="color: #0000ff;">record</span>&gt;
</pre>

<ol class="summary">
<li>button，按钮
<ol class="summary">
<li>states 在state字段属于该状态时显示，其它状态不显示
</li>
<li>name  所调用的函数或者工作流
</li>
<li>string 按钮上所显示的内容
</li>
<li>type为object时该按钮为方法，为workflow时该按钮为工作流
</li>
</ol>

</li>
</ol>


</section>

</div>

<div class="slide">
<header><h1><span class="section-number-2">25</span> form视图常见属性 </h1></header>
