project/okgj/train-temp/view.org
* form视图常见属性
#+begin_src xml
  <record id="view_okgj_stock_picking_extra_form" model="ir.ui.view">
      <field name="name">view.okgj.stock.picking.extra.form</field>
      <field name="model">okgj.stock.picking.extra</field>
      <field eval="16" name="priority"/>
      <field name="arch" type="xml">
          <form string="外挂">
              <field name="order_line">
                  <tree string="Purchase Order Lines" editable="bottom">
                      <field name="product_id" on_change="onchange_product_id(parent.pricelist_id,product_id,0,product_uom,parent.partner_id, parent.date_order,parent.fiscal_position,date_planned,name,price_unit,context)"/>
                      <field name="name"/>
                  </tree>
              </field>
          </form>
      </field>
  </record>
#+end_src
  1. 关联字段展开显示
  2. editable：botton或者top，在底部增加或顶部增加

* form视图常见属性
#+begin_src xml
  <record id="view_okgj_stock_picking_extra_form" model="ir.ui.view">
      <field name="name">view.okgj.stock.picking.extra.form</field>
      <field name="model">okgj.stock.picking.extra</field>
      <field eval="16" name="priority"/>
      <field name="arch" type="xml">
          <form string="外挂">
              <notebook>
                  <page string="Purchase Order">
                      <field name="amount_total" nolabel="1" class="oe_subtotal_footer_separator" widget="monetary" options="{'currency_field': 'currency_id'}"/>
                  </page>
                  <page string="Incoming Shipments &amp; Invoices">
                      <field name="minimum_planned_date"/>
                  </page>
              </notebook>
          </form>
      </field>
  </record>
#+end_src
  1. notebook，页签
  2. page，里面的一个页签

