project/okgj/train-temp/view.html

<section>



<pre class="src src-xml">&lt;<span style="color: #0000ff;">record</span> <span style="color: #a0522d;">id</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">view_okgj_stock_picking_extra_form</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">model</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">ir.ui.view</span><span style="color: #8b2252;">"</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">name</span><span style="color: #8b2252;">"</span>&gt;view.okgj.stock.picking.extra.form&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">model</span><span style="color: #8b2252;">"</span>&gt;okgj.stock.picking.extra&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">eval</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">16</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">priority</span><span style="color: #8b2252;">"</span>/&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">arch</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">type</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">xml</span><span style="color: #8b2252;">"</span>&gt;
        &lt;<span style="color: #0000ff;">form</span> <span style="color: #a0522d;">string</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">&#22806;&#25346;</span><span style="color: #8b2252;">"</span>&gt;
            &lt;<span style="color: #0000ff;">group</span>&gt;
                &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">product_id</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">domain</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">[('type','=','consu')]</span><span style="color: #8b2252;">"</span>/&gt;
                &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">product_qty</span><span style="color: #8b2252;">"</span>/&gt;
            &lt;/<span style="color: #0000ff;">group</span>&gt;
        &lt;/<span style="color: #0000ff;">form</span>&gt;
    &lt;/<span style="color: #0000ff;">field</span>&gt;
&lt;/<span style="color: #0000ff;">record</span>&gt;
</pre>

<ol class="summary">
<li>group，成组
</li>
</ol>


</section>

</div>

<div class="slide">
<header><h1><span class="section-number-2">26</span> form视图常见属性 </h1></header>

<section>



<pre class="src src-xml">&lt;<span style="color: #0000ff;">record</span> <span style="color: #a0522d;">id</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">view_okgj_stock_picking_extra_form</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">model</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">ir.ui.view</span><span style="color: #8b2252;">"</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">name</span><span style="color: #8b2252;">"</span>&gt;view.okgj.stock.picking.extra.form&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">model</span><span style="color: #8b2252;">"</span>&gt;okgj.stock.picking.extra&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">eval</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">16</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">priority</span><span style="color: #8b2252;">"</span>/&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">arch</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">type</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">xml</span><span style="color: #8b2252;">"</span>&gt;
        &lt;<span style="color: #0000ff;">form</span> <span style="color: #a0522d;">string</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">&#22806;&#25346;</span><span style="color: #8b2252;">"</span>&gt;
            &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">order_line</span><span style="color: #8b2252;">"</span>&gt;
                &lt;<span style="color: #0000ff;">tree</span> <span style="color: #a0522d;">string</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">Purchase Order Lines</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">editable</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">bottom</span><span style="color: #8b2252;">"</span>&gt;
                    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">product_id</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">on_change</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">onchange_product_id(parent.pricelist_id,product_id,0,product_uom,parent.partner_id, parent.date_order,parent.fiscal_position,date_planned,name,price_unit,context)</span><span style="color: #8b2252;">"</span>/&gt;
                    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">name</span><span style="color: #8b2252;">"</span>/&gt;
                &lt;/<span style="color: #0000ff;">tree</span>&gt;
            &lt;/<span style="color: #0000ff;">field</span>&gt;
        &lt;/<span style="color: #0000ff;">form</span>&gt;
    &lt;/<span style="color: #0000ff;">field</span>&gt;
&lt;/<span style="color: #0000ff;">record</span>&gt;
</pre>

<ol class="summary">
<li>关联字段展开显示
</li>
<li>editable：botton或者top，在底部增加或顶部增加
</li>
</ol>


</section>

</div>

<div class="slide">
<header><h1><span class="section-number-2">27</span> form视图常见属性 </h1></header>

<section>



<pre class="src src-xml">&lt;<span style="color: #0000ff;">record</span> <span style="color: #a0522d;">id</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">view_okgj_stock_picking_extra_form</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">model</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">ir.ui.view</span><span style="color: #8b2252;">"</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">name</span><span style="color: #8b2252;">"</span>&gt;view.okgj.stock.picking.extra.form&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">model</span><span style="color: #8b2252;">"</span>&gt;okgj.stock.picking.extra&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">eval</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">16</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">priority</span><span style="color: #8b2252;">"</span>/&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">arch</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">type</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">xml</span><span style="color: #8b2252;">"</span>&gt;
        &lt;<span style="color: #0000ff;">form</span> <span style="color: #a0522d;">string</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">&#22806;&#25346;</span><span style="color: #8b2252;">"</span>&gt;
            &lt;<span style="color: #0000ff;">notebook</span>&gt;
                &lt;<span style="color: #0000ff;">page</span> <span style="color: #a0522d;">string</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">Purchase Order</span><span style="color: #8b2252;">"</span>&gt;
                    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">amount_total</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">nolabel</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">1</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">class</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">oe_subtotal_footer_separator</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">widget</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">monetary</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">options</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">{'currency_field': 'currency_id'}</span><span style="color: #8b2252;">"</span>/&gt;
                &lt;/<span style="color: #0000ff;">page</span>&gt;
                &lt;<span style="color: #0000ff;">page</span> <span style="color: #a0522d;">string</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">Incoming Shipments </span><span style="color: #008b8b;">&amp;</span><span style="color: #008b8b;">amp</span><span style="color: #008b8b;">;</span><span style="color: #8b2252;"> Invoices</span><span style="color: #8b2252;">"</span>&gt;
                    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">minimum_planned_date</span><span style="color: #8b2252;">"</span>/&gt;
                &lt;/<span style="color: #0000ff;">page</span>&gt;
            &lt;/<span style="color: #0000ff;">notebook</span>&gt;
        &lt;/<span style="color: #0000ff;">form</span>&gt;
    &lt;/<span style="color: #0000ff;">field</span>&gt;
&lt;/<span style="color: #0000ff;">record</span>&gt;
</pre>

<ol class="summary">
<li>notebook，页签
</li>
<li>page，里面的一个页签
</li>
</ol>


</section>

</div>

<div class="slide">
<header><h1><span class="section-number-2">28</span> form视图常见属性 </h1></header>
