project/okgj/train-temp/view.org
* form视图常见属性
#+begin_src xml
  <record id="view_okgj_stock_picking_extra_form" model="ir.ui.view">
      <field name="name">view.okgj.stock.picking.extra.form</field>
      <field name="model">okgj.stock.picking.extra</field>
      <field eval="16" name="priority"/>
      <field name="arch" type="xml">
          <form string="外挂" version="7.0">
              <field name="product_id" domain="[('type','=','consu')]"/>
          </form>
      </field>
  </record>
#+end_src
  1. version="7.0" 添加该属性后，增加了许多定制功能，html中的div，header, footer, sheet

* tree视图常见属性
#+begin_src xml
  <record id="view_okgj_stock_picking_extra_tree" model="ir.ui.view">
      <field name="name">view.okgj.stock.picking.extra.tree</field>
      <field name="model">okgj.stock.picking.extra</field>
      <field eval="16" name="priority"/>
      <field name="arch" type="xml">
          <tree string="外挂">
              <field name="product_id"/>
          </tree>
      </field>
  </record>
#+end_src
  1. field, button, 继承等与form类似
  2. editable中属性同上

* search视图常见属性
#+begin_src xml
  <record id="view_okgj_stock_picking_extra_search" model="ir.ui.view">
      <field name="name">view.okgj.stock.picking.extra.search</field>
      <field name="model">okgj.stock.picking.extra</field>
      <field eval="16" name="priority"/>
      <field name="arch" type="xml">
          <search string="外挂">
              <field name="product_id"/>
              <filter string="Supplier" domain="[]" context="{'group_by':'partner_id'}"/>
              <filter name="not_invoiced" string="Not Invoiced" domain="[('invoice_ids','=', False)]" help="Purchase orders that include lines not invoiced."/>
          </search>
      </field>
  </record>
#+end_src
  1. field常见过滤
  2. context="{'group_by':'partner_id'}" 按该字段分组
  3. domain="[('invoice_ids','=', False)]" 按该字段过滤
  4. string 该过滤名称
  5. help 该过滤所显示的帮助

* 报表
#+begin_src python
  class report_crm_case_user(osv.osv):
      _name = "report.crm.case.user"
      _description = "Cases by user and section"
      _order = 'name desc, user_id, section_id'
      _auto = False
      _columns = {
          'name': fields.date('Month', readonly=True),
          'user_id':fields.many2one('res.users', 'User',
                                    readonly=True, relate=True),
          'section_id':fields.many2one('crm.case.section', 'Section',
                                       readonly=True, relate=True),
          'amount_revenue': fields.float('Est.Revenue',
                                         readonly=True),
          'amount_costs': fields.float('Est.Cost', readonly=True),
          'amount_revenue_prob': fields.float('Est. Rev*Prob.',
                                              readonly=True),
          'nbr': fields.integer('# of Cases', readonly=True),
          'probability': fields.float('Avg. Probability',
                                      readonly=True),
          'state': fields.selection(AVAILABLE_STATES, 'State',
                                    size=16, readonly=True),
          'delay_close': fields.integer('Delay to close',
                                        readonly=True),
          }
#+end_src  


