project/okgj/train-temp/view.html

<section>



<pre class="src src-xml">&lt;<span style="color: #0000ff;">record</span> <span style="color: #a0522d;">id</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">view_okgj_stock_picking_extra_form</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">model</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">ir.ui.view</span><span style="color: #8b2252;">"</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">name</span><span style="color: #8b2252;">"</span>&gt;view.okgj.stock.picking.extra.form&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">model</span><span style="color: #8b2252;">"</span>&gt;okgj.stock.picking.extra&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">eval</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">16</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">priority</span><span style="color: #8b2252;">"</span>/&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">arch</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">type</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">xml</span><span style="color: #8b2252;">"</span>&gt;
        &lt;<span style="color: #0000ff;">form</span> <span style="color: #a0522d;">string</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">&#22806;&#25346;</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">version</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">7.0</span><span style="color: #8b2252;">"</span>&gt;
            &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">product_id</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">domain</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">[('type','=','consu')]</span><span style="color: #8b2252;">"</span>/&gt;
        &lt;/<span style="color: #0000ff;">form</span>&gt;
    &lt;/<span style="color: #0000ff;">field</span>&gt;
&lt;/<span style="color: #0000ff;">record</span>&gt;
</pre>

<ol class="summary">
<li>version="7.0" 添加该属性后，增加了许多定制功能，html中的div，header, footer, sheet
</li>
</ol>


</section>

</div>

<div class="slide">
<header><h1><span class="section-number-2">29</span> tree视图常见属性 </h1></header>

<section>



<pre class="src src-xml">&lt;<span style="color: #0000ff;">record</span> <span style="color: #a0522d;">id</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">view_okgj_stock_picking_extra_tree</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">model</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">ir.ui.view</span><span style="color: #8b2252;">"</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">name</span><span style="color: #8b2252;">"</span>&gt;view.okgj.stock.picking.extra.tree&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">model</span><span style="color: #8b2252;">"</span>&gt;okgj.stock.picking.extra&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">eval</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">16</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">priority</span><span style="color: #8b2252;">"</span>/&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">arch</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">type</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">xml</span><span style="color: #8b2252;">"</span>&gt;
        &lt;<span style="color: #0000ff;">tree</span> <span style="color: #a0522d;">string</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">&#22806;&#25346;</span><span style="color: #8b2252;">"</span>&gt;
            &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">product_id</span><span style="color: #8b2252;">"</span>/&gt;
        &lt;/<span style="color: #0000ff;">tree</span>&gt;
    &lt;/<span style="color: #0000ff;">field</span>&gt;
&lt;/<span style="color: #0000ff;">record</span>&gt;
</pre>

<ol class="summary">
<li>field, button, 继承等与form类似
</li>
<li>editable中属性同上
</li>
</ol>


</section>

</div>

<div class="slide">
<header><h1><span class="section-number-2">30</span> search视图常见属性 </h1></header>

<section>



<pre class="src src-xml">&lt;<span style="color: #0000ff;">record</span> <span style="color: #a0522d;">id</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">view_okgj_stock_picking_extra_search</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">model</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">ir.ui.view</span><span style="color: #8b2252;">"</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">name</span><span style="color: #8b2252;">"</span>&gt;view.okgj.stock.picking.extra.search&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">model</span><span style="color: #8b2252;">"</span>&gt;okgj.stock.picking.extra&lt;/<span style="color: #0000ff;">field</span>&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">eval</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">16</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">priority</span><span style="color: #8b2252;">"</span>/&gt;
    &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">arch</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">type</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">xml</span><span style="color: #8b2252;">"</span>&gt;
        &lt;<span style="color: #0000ff;">search</span> <span style="color: #a0522d;">string</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">&#22806;&#25346;</span><span style="color: #8b2252;">"</span>&gt;
            &lt;<span style="color: #0000ff;">field</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">product_id</span><span style="color: #8b2252;">"</span>/&gt;
            &lt;<span style="color: #0000ff;">filter</span> <span style="color: #a0522d;">string</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">Supplier</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">domain</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">[]</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">context</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">{'group_by':'partner_id'}</span><span style="color: #8b2252;">"</span>/&gt;
            &lt;<span style="color: #0000ff;">filter</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">not_invoiced</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">string</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">Not Invoiced</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">domain</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">[('invoice_ids','=', False)]</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">help</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">Purchase orders that include lines not invoiced.</span><span style="color: #8b2252;">"</span>/&gt;
        &lt;/<span style="color: #0000ff;">search</span>&gt;
    &lt;/<span style="color: #0000ff;">field</span>&gt;
&lt;/<span style="color: #0000ff;">record</span>&gt;
</pre>

<ol class="summary">
<li>field常见过滤
</li>
<li>context="{'group_by':'partner_id'}" 按该字段分组
</li>
<li>domain="[('invoice_ids','=', False)]" 按该字段过滤
</li>
<li>string 该过滤名称
</li>
<li>help 该过滤所显示的帮助
</li>
</ol>


</section>

</div>

<div class="slide">
<header><h1><span class="section-number-2">31</span> 报表 </h1></header>

<section>



<pre class="src src-python"><span style="color: #a020f0;">class</span> <span style="color: #228b22;">report_crm_case_user</span>(osv.osv):
    _name = <span style="color: #8b2252;">"report.crm.case.user"</span>
    _description = <span style="color: #8b2252;">"Cases by user and section"</span>
    _order = <span style="color: #8b2252;">'name desc, user_id, section_id'</span>
    _auto = <span style="color: #a020f0;">False</span>
    _columns = {
        <span style="color: #8b2252;">'name'</span>: fields.date(<span style="color: #8b2252;">'Month'</span>, readonly=<span style="color: #a020f0;">True</span>),
        <span style="color: #8b2252;">'user_id'</span>:fields.many2one(<span style="color: #8b2252;">'res.users'</span>, <span style="color: #8b2252;">'User'</span>,
                                  readonly=<span style="color: #a020f0;">True</span>, relate=<span style="color: #a020f0;">True</span>),
        <span style="color: #8b2252;">'section_id'</span>:fields.many2one(<span style="color: #8b2252;">'crm.case.section'</span>, <span style="color: #8b2252;">'Section'</span>,
                                     readonly=<span style="color: #a020f0;">True</span>, relate=<span style="color: #a020f0;">True</span>),
        <span style="color: #8b2252;">'amount_revenue'</span>: fields.float(<span style="color: #8b2252;">'Est.Revenue'</span>,
                                       readonly=<span style="color: #a020f0;">True</span>),
        <span style="color: #8b2252;">'amount_costs'</span>: fields.float(<span style="color: #8b2252;">'Est.Cost'</span>, readonly=<span style="color: #a020f0;">True</span>),
        <span style="color: #8b2252;">'amount_revenue_prob'</span>: fields.float(<span style="color: #8b2252;">'Est. Rev*Prob.'</span>,
                                            readonly=<span style="color: #a020f0;">True</span>),
        <span style="color: #8b2252;">'nbr'</span>: fields.integer(<span style="color: #8b2252;">'# of Cases'</span>, readonly=<span style="color: #a020f0;">True</span>),
        <span style="color: #8b2252;">'probability'</span>: fields.float(<span style="color: #8b2252;">'Avg. Probability'</span>,
                                    readonly=<span style="color: #a020f0;">True</span>),
        <span style="color: #8b2252;">'state'</span>: fields.selection(AVAILABLE_STATES, <span style="color: #8b2252;">'State'</span>,
                                  size=16, readonly=<span style="color: #a020f0;">True</span>),
        <span style="color: #8b2252;">'delay_close'</span>: fields.integer(<span style="color: #8b2252;">'Delay to close'</span>,
                                      readonly=<span style="color: #a020f0;">True</span>),
        }
</pre>



</section>

</div>

<div class="slide">
<header><h1><span class="section-number-2">32</span> 报表续一 </h1></header>
